In [1]:
import pandas as pd

In [6]:
movies = pd.read_csv("/data/movielens/movies.csv")
movies.shape

(9125, 3)

In [5]:
ratings = pd.read_csv("/data/movielens/ratings.csv")
ratings.shape

(100004, 4)

In [8]:
movies[movies.title.str.contains("Godfather")]

      movieId                            title                        genres
695       858            Godfather, The (1972)                   Crime|Drama
977      1221   Godfather: Part II, The (1974)                   Crime|Drama
1585     2023  Godfather: Part III, The (1990)  Crime|Drama|Mystery|Thriller
5470     8607          Tokyo Godfathers (2003)     Adventure|Animation|Drama

In [10]:
movies[movies.title.str.contains("Godfather")].movieId[695]

858

In [12]:
ratings[ratings.movieId == 858].shape

(200, 4)

In [13]:
ratings[ratings.movieId == 858].rating.mean()

4.4875

In [14]:
avg_rating = ratings.groupby("movieId")\
.rating.agg(["mean", "count"])

In [17]:
avg_rating.loc[858,:]

mean       4.4875
count    200.0000
Name: 858, dtype: float64

In [20]:
avg_rating.reset_index().query("movieId == 858")

     movieId    mean  count
695      858  4.4875    200

In [23]:
avg_rating.reset_index().query("movieId == 858")["mean"].values[0]

4.4875

In [28]:
avg_rating[avg_rating["count"]>100].shape

(149, 2)

In [30]:
avg_rating

             mean  count
movieId
1        3.872470    247
2        3.401869    107
3        3.161017     59
4        2.384615     13
5        3.267857     56
...           ...    ...
161944   5.000000      1
162376   4.500000      1
162542   5.000000      1
162672   3.000000      1
163949   5.000000      1

[9066 rows x 2 columns]

In [34]:
top10 = avg_rating[avg_rating["count"]>100]\
.sort_values("mean", ascending = False)\
.iloc[:10,:]
top10

             mean  count
movieId
858      4.487500    200
318      4.487138    311
1221     4.385185    135
50       4.370647    201
527      4.303279    244
1193     4.256944    144
608      4.256696    224
296      4.256173    324
2858     4.236364    220
58559    4.235537    121

In [35]:
top10.merge(movies, on = "movieId")

,movieId,mean,count,title,genres
0,858,4.487500,200,"Godfather, The (1972)",Crime|Drama
1,318,4.487138,311,"Shawshank Redemption, The (1994)",Crime|Drama
2,1221,4.385185,135,"Godfather: Part II, The (1974)",Crime|Drama
3,50,4.370647,201,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
4,527,4.303279,244,Schindler's List (1993),Drama|War
5,1193,4.256944,144,One Flew Over the Cuckoo's Nest (1975),Drama
6,608,4.256696,224,Fargo (1996),Comedy|Crime|Drama|Thriller
7,296,4.256173,324,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
8,2858,4.236364,220,American Beauty (1999),Drama|Romance
9,58559,4.235537,121,"Dark Knight, The (2008)",Action|Crime|Drama|IMAX

In [38]:
joined = ratings.merge(movies, on = "movieId")
joined

,userId,movieId,rating,timestamp,title,genres
0,1,31,2.5,1260759144,Dangerous Minds (1995),Drama
1,7,31,3.0,851868750,Dangerous Minds (1995),Drama
2,31,31,4.0,1273541953,Dangerous Minds (1995),Drama
3,32,31,4.0,834828440,Dangerous Minds (1995),Drama
4,36,31,3.0,847057202,Dangerous Minds (1995),Drama
...,...,...,...,...,...,...
99999,664,64997,2.5,1343761859,War of the Worlds (2005),Action|Sci-Fi
100000,664,72380,3.5,1344435977,"Box, The (2009)",Drama|Horror|Mystery|Sci-Fi|Thriller
100001,665,129,3.0,995232528,Pie in the Sky (1996),Comedy|Romance
100002,665,4736,1.0,1010197684,Summer Catch (2001),Comedy|Drama|Romance
100003,668,6425,1.0,993613478,"6th Man, The (Sixth Man, The) (1997)",Comedy

In [45]:
df1 = joined[joined.title.str.contains("Godfather")]

In [48]:
df1[df1.title.str.contains("1972")].shape

(200, 6)